const TitleName = {
    Mr: 'นาย',          // สำหรับผู้ชาย
    Miss: 'นางสาว',    // สำหรับหญิงโสด
    Mrs: 'นาง',         // สำหรับหญิงแต่งงาน
    Ms: 'นาง',          // สำหรับหญิงที่ไม่ต้องการระบุสถานะการสมรส
    Dr: 'ดร.',           // สำหรับหมอหรือบุคคลที่ได้รับปริญญาเอก
    Prof: 'ศาสตราจารย์', // สำหรับศาสตราจารย์
    Rev: 'พระ',          // สำหรับนักบวชหรือนักศึกษาวิชาการทางศาสนา
    Sir: 'ท่าน',         // ใช้กับชายที่มีตำแหน่งสูง
    Lady: 'คุณหญิง',    // ใช้กับผู้หญิงที่มีตำแหน่งสูง
    Prof: 'ศาสตราจารย์', // ใช้กับศาสตราจารย์
    Dr: 'ดร.',           // ใช้กับบุคคลที่ได้รับปริญญาเอก
    Mx: 'เพศเดียวกัน',  // ใช้กับบุคคลที่ไม่ต้องการระบุเพศ
};

const BloodGroups = {
    A: 'กรุ๊ปเลือด A',
    B: 'กรุ๊ปเลือด B',
    AB: 'กรุ๊ปเลือด AB',
    O: 'กรุ๊ปเลือด O'
};